## SQL Practice

> Based on notes on: https://www.youtube.com/watch?v=gwp3dJUsy5g

---

### SQL Order of execution

> https://sqlbolt.com/lesson/select_queries_order_of_execution

```sql
SELECT DISTINCT column, AGG_FUNC(column_or_expression), …
FROM mytable
    JOIN another_table
      ON mytable.column = another_table.column
    WHERE constraint_expression
    GROUP BY column
    HAVING constraint_expression
    ORDER BY column ASC/DESC
    LIMIT count OFFSET COUNT;
```


1. FROM and JOIN

The FROM clause, and subsequent JOINs are first executed to determine the total working set of data that is being queried. This includes subqueries in this clause, and can cause temporary tables to be created under the hood containing all the columns and rows of the tables being joined.

2. WHERE

Once we have the total working set of data, the first-pass WHERE constraints are applied to the individual rows, and rows that do not satisfy the constraint are discarded. Each of the constraints can only access columns directly from the tables requested in the FROM clause. __Aliases in the SELECT part of the query are not accessible in most databases since they may include expressions dependent on parts of the query that have not yet executed.__

3. GROUP BY

The remaining rows after the WHERE constraints are applied are then grouped based on common values in the column specified in the GROUP BY clause. __As a result of the grouping, there will only be as many rows as there are unique values in that column__. Implicitly, this means that you should only need to use this when you have aggregate functions in your query.

4. HAVING

If the query has a GROUP BY clause, then the constraints in the HAVING clause are then applied to the grouped rows, discard the grouped rows that don't satisfy the constraint. __Like the WHERE clause, aliases are also not accessible from this step in most databases__.

5. SELECT

Any expressions in the SELECT part of the query are finally computed.

6. DISTINCT

Of the remaining rows, rows with duplicate values in the column marked as DISTINCT will be discarded.

7. ORDER BY

If an order is specified by the ORDER BY clause, the rows are then sorted by the specified data in either ascending or descending order. Since all the expressions in the SELECT part of the query have been computed, you can reference aliases in this clause.


8. LIMIT / OFFSET

Finally, the rows that fall outside the range specified by the LIMIT and OFFSET are discarded, leaving the final set of rows to be returned from the query.





### Difference bw DISTINCT and GROUP BY

> https://www.sitepoint.com/community/t/mysql-when-group-by-is-faster-than-distinct/272420

In some cases GROUP BY might be faster than DISTICT

- When you run DISTINCT MySQL has to looks across all selected columns whereas GROUP BY will only do it for whatever columns you explicitly assign to GROUP BY so there is less work to do (my query was selecting about 15 columns)

this is true as far as it goes… however, if you have GROUP BY with only a few of your 15 columns, then technically you are running an invalid query in mysql (yes, mysql will run these invalid queries), and the results are indeterminate

### Combining Data

#### Unions

Put simply, a union (SQL Union) is the process of stacking two tables on top of one another. You will usually do this when your data is split up into multiple sections like an excel spreadsheet of a year’s sales split by month.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fa5adad37-92c6-4924-b52c-2ab340ae351b%2FScreen_Shot_2021-03-15_at_12.23.40_PM.png?table=block&id=199c2a41-408a-4898-a329-c7810d5d9a39&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=1390&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

#### Joins

Joins combine two tables horizontally. For a join, like a Union you have to have at least two tables, what we call our Left Table and our Right Table. You (mostly) have to have at least one matching column between the two tables, and you will match rows from these columns. The most common way to visualize the types of Joins are through Venn Diagrams.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fba7b4d86-db23-4142-b860-2e23fce3bae4%2FScreen_Shot_2021-03-15_at_12.36.03_PM.png?table=block&id=31a987e2-12d3-4d95-bdbc-a37449be2b29&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=2000&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fe94f8697-5537-4458-9992-4ea02defbea0%2FScreen_Shot_2021-03-15_at_12.36.37_PM.png?table=block&id=91c32502-734f-4ef3-90b6-d9725da9cd3b&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=960&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

__Inner Join__

We’re now going to do something called an Inner Join on the [ID] column which will only output exact matches from the [ID] column in our output.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F1d7856a8-7fc5-4673-a7a6-522d5fd52a9c%2FScreen_Shot_2021-03-15_at_12.37.59_PM.png?table=block&id=b5c56e80-bb05-4dc5-955b-073c3d231bfc&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=1370&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

__Left Join__

A Left Join keeps all of the data from your Left table and whatever matches from the Right table.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fa4b067dc-dd79-4456-8cae-2f81a8ac4201%2FScreen_Shot_2021-03-15_at_12.39.07_PM.png?table=block&id=f0f911be-573d-415e-b829-873cd6c300c1&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=1350&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

__Right Join__

A Right Join does the exact opposite and keeps everything from your Right table while only bringing in the matches from the Left table.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F1235ef85-ef65-4e03-ba26-6661b39bad62%2FScreen_Shot_2021-03-15_at_12.39.43_PM.png?table=block&id=fd1880dd-7d29-477b-b654-7e22a9b9873c&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=1360&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

__Full Join__

A Full Join brings in everything from both tables and matches whatever will match from the columns you specify.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fe42b3cca-c8df-48fb-9b63-211c498be6a9%2FScreen_Shot_2021-03-15_at_12.40.52_PM.png?table=block&id=02ceefe0-20a9-48f7-831d-88698f314d43&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=1360&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

__Cross Join__

The CROSS JOIN is used to generate a paired combination of each row of the first table with each row of the second table. This join type is also known as cartesian join.

Suppose that we are sitting in a coffee shop and we decide to order breakfast. Shortly, we will look at the menu and we will start thinking of which meal and drink combination could be more tastier. Our brain will receive this signal and begin to generate all meal and drink combinations.

The following image illustrates all menu combinations that can be generated by our brain. The SQL CROSS JOIN works similarly to this mechanism, as it creates all paired combinations of the rows of the tables that will be joined.

![](https://www.sqlshack.com/wp-content/uploads/2020/02/sql-cross-join-working-mechanism.png)

The SQL queries which contain the CROSS JOIN keyword can be very costly as it will need nested loops. We try to say that these queries have a high potential to consume more resources and can cause performance issues.

Briefly, when we decide to use the CROSS JOIN in any query, we should consider the number of the tables that will be joined. Such as, when we CROSS JOIN two tables and if the first one contains 1000 rows and the second one contains 1000 rows, the row count of the resultset will be 1.000.000 rows.

---

Joins can get a bit tricky because of the potential for gotchas when joining two tables. The most common one is row duplication where you accidentally duplicate rows because the columns you’re matching on have multiple potential matches. In the example below we’re going to try an Inner Join. You’ll notice the columns in Orange were duplicated.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F89439f1d-e24a-4451-bd0d-37a0dfcc4487%2FScreen_Shot_2021-03-15_at_12.42.17_PM.png?table=block&id=9bac2f13-52ee-4ac9-9bc8-806a6d7187d0&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=1370&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

This isn’t an error per se but it is something to watch out for as it can cause you to duplicate data you don’t intend to duplicate.

![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F8d64f5ba-d067-40f5-94bb-32beb9fe49d1%2FScreen_Shot_2021-03-15_at_12.42.37_PM.png?table=block&id=6a39c3e9-2900-4be6-9dc2-bbb14f68181a&spaceId=691f8197-dec0-4338-b1a8-a47162b151ba&width=1360&userId=bdc14b6b-7340-420b-85e2-540dbef29bc8&cache=v2)

### LIKE, BETWEEN, IN

https://www.w3schools.com/sql/sql_wildcards.asp

```
SELECT *
FROM dataset_1
WHERE weather LIKE 'Sun%';
```

```
SELECT DISTINCT temperature 
FROM dataset_1
WHERE temperature BETWEEN 29 AND 75;
```


```
SELECT occupation
FROM dataset_1
WHERE occupation IN ('Sales & Related', 'Management');
```

### Window functions

> Based on tutorial : https://www.youtube.com/watch?v=Ww71knvhQ-s

---

We create an `employee` table

![](https://i.imgur.com/dehIA2J.png)


what i want is all the cols from employee table along with a max_salary column, which displays the overall max salary

```
SELECT e.*,
MAX(SALARY) OVER() as max_salary 
FROM employee e;
```


```
emp_ID|emp_NAME|DEPT_NAME|SALARY|max_salary|
------+--------+---------+------+----------+
   101|Mohan   |Admin    |  4000|     11000|
   102|Rajkumar|HR       |  3000|     11000|
   103|Akbar   |IT       |  4000|     11000|
   104|Dorvin  |Finance  |  6500|     11000|
   105|Rohit   |HR       |  3000|     11000|
   106|Rajesh  |Finance  |  5000|     11000|
   107|Preet   |HR       |  7000|     11000|
   108|Maryam  |Admin    |  4000|     11000|
   109|Sanjay  |IT       |  6500|     11000|
   110|Vasudha |IT       |  7000|     11000|
   111|Melinda |IT       |  8000|     11000|
   112|Komal   |IT       | 10000|     11000|
   113|Gautham |Admin    |  2000|     11000|
   114|Manisha |HR       |  3000|     11000|
   115|Chandni |IT       |  4500|     11000|
   116|Satya   |Finance  |  6500|     11000|
   117|Adarsh  |HR       |  3500|     11000|
   118|Tejaswi |Finance  |  5500|     11000|
   119|Cory    |HR       |  8000|     11000|
   120|Monica  |Admin    |  5000|     11000|
   121|Rosalin |IT       |  6000|     11000|
   122|Ibrahim |IT       |  8000|     11000|
   123|Vikram  |IT       |  8000|     11000|
   124|Dheeraj |IT       | 11000|     11000|
   ````

Since we are using an `OVER` clause, SQL does not tream max as an agg function, it will treat it as a window function. But we have not specified any col in the over clause, so it will consider a window over the entire dataset


Now we want the max salary for each dept along with other cols

```
SELECT e.*,
MAX(SALARY) OVER(PARTION BY DEPT_NAME) as max_salary 
FROM employee e;
```

Now for every distinct value of dept, sql creates a window and calculates the max salary for that window

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|max_salary|
------+--------+---------+------+----------+
   101|Mohan   |Admin    |  4000|      5000|
   108|Maryam  |Admin    |  4000|      5000|
   113|Gautham |Admin    |  2000|      5000|
   120|Monica  |Admin    |  5000|      5000|
   104|Dorvin  |Finance  |  6500|      6500|
   106|Rajesh  |Finance  |  5000|      6500|
   116|Satya   |Finance  |  6500|      6500|
   118|Tejaswi |Finance  |  5500|      6500|
   102|Rajkumar|HR       |  3000|      8000|
   105|Rohit   |HR       |  3000|      8000|
   107|Preet   |HR       |  7000|      8000|
   114|Manisha |HR       |  3000|      8000|
   117|Adarsh  |HR       |  3500|      8000|
   119|Cory    |HR       |  8000|      8000|
   103|Akbar   |IT       |  4000|     11000|
   109|Sanjay  |IT       |  6500|     11000|
   110|Vasudha |IT       |  7000|     11000|
   111|Melinda |IT       |  8000|     11000|
   112|Komal   |IT       | 10000|     11000|
   115|Chandni |IT       |  4500|     11000|
   121|Rosalin |IT       |  6000|     11000|
   122|Ibrahim |IT       |  8000|     11000|
   123|Vikram  |IT       |  8000|     11000|
   124|Dheeraj |IT       | 11000|     11000|
```

We can use MAX, MIN, COUNT, SUM - the agg functions we use with GROUP BY

But there are some specific window functions as well:

#### Row number

This simply assigns an id to every record in our table

```
SELECT e.*,
ROW_NUMBER () OVER() AS rn
FROM employee e 
```

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|rn|
------+--------+---------+------+--+
   101|Mohan   |Admin    |  4000| 1|
   102|Rajkumar|HR       |  3000| 2|
   103|Akbar   |IT       |  4000| 3|
   104|Dorvin  |Finance  |  6500| 4|
   105|Rohit   |HR       |  3000| 5|
   106|Rajesh  |Finance  |  5000| 6|
   107|Preet   |HR       |  7000| 7|
   108|Maryam  |Admin    |  4000| 8|
   109|Sanjay  |IT       |  6500| 9|
   110|Vasudha |IT       |  7000|10|
   111|Melinda |IT       |  8000|11|
   112|Komal   |IT       | 10000|12|
   113|Gautham |Admin    |  2000|13|
   114|Manisha |HR       |  3000|14|
   115|Chandni |IT       |  4500|15|
   116|Satya   |Finance  |  6500|16|
   117|Adarsh  |HR       |  3500|17|
   118|Tejaswi |Finance  |  5500|18|
   119|Cory    |HR       |  8000|19|
   120|Monica  |Admin    |  5000|20|
   121|Rosalin |IT       |  6000|21|
   122|Ibrahim |IT       |  8000|22|
   123|Vikram  |IT       |  8000|23|
   124|Dheeraj |IT       | 11000|24|
```

```
SELECT e.*,
ROW_NUMBER () OVER(PARTITION BY DEPT_NAME) AS rn
FROM employee e 
```

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|rn|
------+--------+---------+------+--+
   101|Mohan   |Admin    |  4000| 1|
   108|Maryam  |Admin    |  4000| 2|
   113|Gautham |Admin    |  2000| 3|
   120|Monica  |Admin    |  5000| 4|
   104|Dorvin  |Finance  |  6500| 1|
   106|Rajesh  |Finance  |  5000| 2|
   116|Satya   |Finance  |  6500| 3|
   118|Tejaswi |Finance  |  5500| 4|
   102|Rajkumar|HR       |  3000| 1|
   105|Rohit   |HR       |  3000| 2|
   107|Preet   |HR       |  7000| 3|
   114|Manisha |HR       |  3000| 4|
   117|Adarsh  |HR       |  3500| 5|
   119|Cory    |HR       |  8000| 6|
   103|Akbar   |IT       |  4000| 1|
   109|Sanjay  |IT       |  6500| 2|
   110|Vasudha |IT       |  7000| 3|
   111|Melinda |IT       |  8000| 4|
   112|Komal   |IT       | 10000| 5|
   115|Chandni |IT       |  4500| 6|
   121|Rosalin |IT       |  6000| 7|
   122|Ibrahim |IT       |  8000| 8|
   123|Vikram  |IT       |  8000| 9|
   124|Dheeraj |IT       | 11000|10|
```

__Say we want to fetch 1st 2 employees that joined company in each dept__

Assume emp_id is lower for employees who joined earlier

```
SELECT * FROM (
	SELECT e.*,
	ROW_NUMBER () OVER(PARTITION BY DEPT_NAME ORDER BY emp_ID) AS rn
	FROM employee e 
) x
WHERE x.rn < 3
```


```
emp_ID|emp_NAME|DEPT_NAME|SALARY|rn|
------+--------+---------+------+--+
   101|Mohan   |Admin    |  4000| 1|
   108|Maryam  |Admin    |  4000| 2|
   104|Dorvin  |Finance  |  6500| 1|
   106|Rajesh  |Finance  |  5000| 2|
   102|Rajkumar|HR       |  3000| 1|
   105|Rohit   |HR       |  3000| 2|
   103|Akbar   |IT       |  4000| 1|
   109|Sanjay  |IT       |  6500| 2|
```

__Fetch top 3 employees in each dept earning max salary__

We can use the rank or dense_rank function

```
SELECT * FROM (
	SELECT e.*,
	RANK() OVER(PARTITION BY DEPT_NAME ORDER BY SALARY DESC) AS `rank`
	FROM employee e 
) x
WHERE x.rank < 4
```

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|rank|
------+--------+---------+------+----+
   120|Monica  |Admin    |  5000|   1|
   101|Mohan   |Admin    |  4000|   2|
   108|Maryam  |Admin    |  4000|   2|
   104|Dorvin  |Finance  |  6500|   1|
   116|Satya   |Finance  |  6500|   1|
   118|Tejaswi |Finance  |  5500|   3|
   119|Cory    |HR       |  8000|   1|
   107|Preet   |HR       |  7000|   2|
   117|Adarsh  |HR       |  3500|   3|
   124|Dheeraj |IT       | 11000|   1|
   112|Komal   |IT       | 10000|   2|
   111|Melinda |IT       |  8000|   3|
   122|Ibrahim |IT       |  8000|   3|
   123|Vikram  |IT       |  8000|   3|
```

__Rank vs Dense Rank vs Row no__

```
SELECT e.*,
RANK() OVER(PARTITION BY DEPT_NAME ORDER BY SALARY DESC) AS `rank`,
DENSE_RANK () OVER(PARTITION BY DEPT_NAME ORDER BY SALARY DESC) AS `dense_rank`,
ROW_NUMBER () OVER(PARTITION BY DEPT_NAME ORDER BY SALARY DESC) AS `rn`
FROM employee e 
```

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|rank|dense_rank|rn|
------+--------+---------+------+----+----------+--+
   120|Monica  |Admin    |  5000|   1|         1| 1|
   101|Mohan   |Admin    |  4000|   2|         2| 2|
   108|Maryam  |Admin    |  4000|   2|         2| 3|
   113|Gautham |Admin    |  2000|   4|         3| 4|
   104|Dorvin  |Finance  |  6500|   1|         1| 1|
   116|Satya   |Finance  |  6500|   1|         1| 2|
   118|Tejaswi |Finance  |  5500|   3|         2| 3|
   106|Rajesh  |Finance  |  5000|   4|         3| 4|
   119|Cory    |HR       |  8000|   1|         1| 1|
   107|Preet   |HR       |  7000|   2|         2| 2|
   117|Adarsh  |HR       |  3500|   3|         3| 3|
   102|Rajkumar|HR       |  3000|   4|         4| 4|
   105|Rohit   |HR       |  3000|   4|         4| 5|
   114|Manisha |HR       |  3000|   4|         4| 6|
   124|Dheeraj |IT       | 11000|   1|         1| 1|
   112|Komal   |IT       | 10000|   2|         2| 2|
   111|Melinda |IT       |  8000|   3|         3| 3|
   122|Ibrahim |IT       |  8000|   3|         3| 4|
   123|Vikram  |IT       |  8000|   3|         3| 5|
   110|Vasudha |IT       |  7000|   6|         4| 6|
   109|Sanjay  |IT       |  6500|   7|         5| 7|
   121|Rosalin |IT       |  6000|   8|         6| 8|
   115|Chandni |IT       |  4500|   9|         7| 9|
   103|Akbar   |IT       |  4000|  10|         8|10|
```

Rank skips the next rank if there are duplicates 1->2->2->4
Dense rank does not skip ranks: 1->2->2->3
Row number simply assigns an id to each entry, it does not care for duplicates 1->2->3->4 irrespective of duplicates

__Lead and Lag__

> Also read: https://learnsql.com/blog/lead-and-lag-functions-in-sql/


Basic Lead and Lag

```
SELECT e.*,
LAG(SALARY) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) AS prev_emp_salary,
LEAD(SALARY) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) AS next_emp_salary
FROM employee e
```

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|prev_emp_salary|next_emp_salary|
------+--------+---------+------+---------------+---------------+
   101|Mohan   |Admin    |  4000|               |           4000|
   108|Maryam  |Admin    |  4000|           4000|           2000|
   113|Gautham |Admin    |  2000|           4000|           5000|
   120|Monica  |Admin    |  5000|           2000|               |
   104|Dorvin  |Finance  |  6500|               |           5000|
   106|Rajesh  |Finance  |  5000|           6500|           6500|
   116|Satya   |Finance  |  6500|           5000|           5500|
   118|Tejaswi |Finance  |  5500|           6500|               |
   102|Rajkumar|HR       |  3000|               |           3000|
   105|Rohit   |HR       |  3000|           3000|           7000|
   107|Preet   |HR       |  7000|           3000|           3000|
   114|Manisha |HR       |  3000|           7000|           3500|
   117|Adarsh  |HR       |  3500|           3000|           8000|
   119|Cory    |HR       |  8000|           3500|               |
   103|Akbar   |IT       |  4000|               |           6500|
   109|Sanjay  |IT       |  6500|           4000|           7000|
   110|Vasudha |IT       |  7000|           6500|           8000|
   111|Melinda |IT       |  8000|           7000|          10000|
   112|Komal   |IT       | 10000|           8000|           4500|
   115|Chandni |IT       |  4500|          10000|           6000|
   121|Rosalin |IT       |  6000|           4500|           8000|
   122|Ibrahim |IT       |  8000|           6000|           8000|
   123|Vikram  |IT       |  8000|           8000|          11000|
   124|Dheeraj |IT       | 11000|           8000|               |
```


Lead and lag follow the syntax: `LAG(expression [,offset[,default_value]]) OVER(ORDER BY columns)`

These functions take three arguments: the name of the column or an expression from which the value is obtained, the number of rows to skip (offset) above, and the default value to be returned if the stored value obtained from the row above is empty. Only the first argument is required. The third argument (default value) is allowed only if you specify the second argument, the offset.

```
--- Lead and Lag
SELECT e.*,
LAG(SALARY, 2, -1) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) AS prev_emp_salary,
LEAD(SALARY, 2, -1) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) AS next_emp_salary
FROM employee e
```

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|prev_emp_salary|next_emp_salary|
------+--------+---------+------+---------------+---------------+
   101|Mohan   |Admin    |  4000|             -1|           2000|
   108|Maryam  |Admin    |  4000|             -1|           5000|
   113|Gautham |Admin    |  2000|           4000|             -1|
   120|Monica  |Admin    |  5000|           4000|             -1|
   104|Dorvin  |Finance  |  6500|             -1|           6500|
   106|Rajesh  |Finance  |  5000|             -1|           5500|
   116|Satya   |Finance  |  6500|           6500|             -1|
   118|Tejaswi |Finance  |  5500|           5000|             -1|
   102|Rajkumar|HR       |  3000|             -1|           7000|
   105|Rohit   |HR       |  3000|             -1|           3000|
   107|Preet   |HR       |  7000|           3000|           3500|
   114|Manisha |HR       |  3000|           3000|           8000|
   117|Adarsh  |HR       |  3500|           7000|             -1|
   119|Cory    |HR       |  8000|           3000|             -1|
   103|Akbar   |IT       |  4000|             -1|           7000|
   109|Sanjay  |IT       |  6500|             -1|           8000|
   110|Vasudha |IT       |  7000|           4000|          10000|
   111|Melinda |IT       |  8000|           6500|           4500|
   112|Komal   |IT       | 10000|           7000|           6000|
   115|Chandni |IT       |  4500|           8000|           8000|
   121|Rosalin |IT       |  6000|          10000|           8000|
   122|Ibrahim |IT       |  8000|           4500|          11000|
   123|Vikram  |IT       |  8000|           6000|             -1|
   124|Dheeraj |IT       | 11000|           8000|             -1|
```

compare salary of each employee with prev one in the dept:

```
SELECT e.*,
LAG(SALARY) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) AS prev_emp_salary,
CASE WHEN e.SALARY > LAG(SALARY) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) THEN 'higher than prev'
	WHEN e.SALARY < LAG(SALARY) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) THEN 'lower than prev'
	WHEN e.SALARY = LAG(SALARY) OVER (PARTITION BY DEPT_NAME ORDER BY emp_ID) THEN 'same as prev'
END salary_comparison
FROM employee e
```

```
emp_ID|emp_NAME|DEPT_NAME|SALARY|prev_emp_salary|salary_comparison|
------+--------+---------+------+---------------+-----------------+
   101|Mohan   |Admin    |  4000|               |                 |
   108|Maryam  |Admin    |  4000|           4000|     same as prev|
   113|Gautham |Admin    |  2000|           4000|  lower than prev|
   120|Monica  |Admin    |  5000|           2000| higher than prev|
   104|Dorvin  |Finance  |  6500|               |                 |
   106|Rajesh  |Finance  |  5000|           6500|  lower than prev|
   116|Satya   |Finance  |  6500|           5000| higher than prev|
   118|Tejaswi |Finance  |  5500|           6500|  lower than prev|
   102|Rajkumar|HR       |  3000|               |                 |
   105|Rohit   |HR       |  3000|           3000|     same as prev|
   107|Preet   |HR       |  7000|           3000| higher than prev|
   114|Manisha |HR       |  3000|           7000|  lower than prev|
   117|Adarsh  |HR       |  3500|           3000| higher than prev|
   119|Cory    |HR       |  8000|           3500| higher than prev|
   103|Akbar   |IT       |  4000|               |                 |
   109|Sanjay  |IT       |  6500|           4000| higher than prev|
   110|Vasudha |IT       |  7000|           6500| higher than prev|
   111|Melinda |IT       |  8000|           7000| higher than prev|
   112|Komal   |IT       | 10000|           8000| higher than prev|
   115|Chandni |IT       |  4500|          10000|  lower than prev|
   121|Rosalin |IT       |  6000|           4500| higher than prev|
   122|Ibrahim |IT       |  8000|           6000| higher than prev|
   123|Vikram  |IT       |  8000|           8000|     same as prev|
   124|Dheeraj |IT       | 11000|           8000| higher than prev|
```

### Finding streaks

> https://www.youtube.com/watch?v=VEjxlKBkZGM
---

Imagine a player had the following results:

![](https://i.imgur.com/ZfBBlqM.png)

The question is how do we detect these 2 streaks

The method we use here is

- Add row no for wins and losses
- Add row no for wins separately and loss separately
- subtract the 2

![](https://i.imgur.com/HhXfnny.png)

The subtraction gives us a column like `streak_id`

We do this in the following CTE:

```sql
WITH CTE AS
(
    SELECT *,
    ROW_NUMBER() OVER(PARTITION BY player_id ORDER BY match_date) AS `all_id`,
    ROW_NUMBER() OVER(PARTITION BY player_id, match_result ORDER BY match_date) AS `win_loss_id`
    FROM
    players_results
    ORDER BY player_id, match_date
)

```


This gives us result like:

![](https://i.imgur.com/p3f5y35.png)

Now we compute the `streak_id`

```sql
CTE2 AS
(
SELECT 
player_id,
match_date,
match_result,
CAST(win_loss_id AS SIGNED) - CAST(all_id AS SIGNED) AS `streak_id`
FROM CTE
)
```

This gives us:

![](https://i.imgur.com/6AY21Nd.png)

Now for each streak_id we want to count no of times it has occured (note streak ids might get repeated for wins and losses and also for diff players)
Now we only care about winning results, so we filter by wins

```sql
CTE3 AS(
SELECT player_id,
streak_id, COUNT(*) AS `win_streak_length`
FROM CTE2
WHERE match_result='W'
GROUP BY player_id, streak_id
)
```

![](https://i.imgur.com/ab5PQP7.png)

Finally we can get the max of winning streak lengths per player id:

```sql
SELECT player_id, 
MAX(win_streak_length)
FROM CTE3
GROUP BY player_id
```

![](https://i.imgur.com/qGxVHje.png)

#### SQL Question 1

> https://platform.stratascratch.com/coding/9899-percentage-of-total-spend?python&utm_source=youtube&utm_medium=click&utm_campaign=YT+description+link

```
--- INNER JOIN AS WE WANT ONLY CUSTOMERS WHO HAVE PLACED AN ORDER

select first_name,order_details,
total_order_cost/SUM(total_order_cost) OVER(PARTITION BY first_name) AS "percentage of the order cost"

from orders o
INNER JOIN customers c
ON o.cust_id = c.id
```

#### SQL Question 2

> https://platform.stratascratch.com/coding/2036-lowest-revenue-generated-restaurants?python&utm_source=youtube&utm_medium=click&utm_campaign=YT+description+link

```
--- Filter data to only use May 2020 records
SELECT * FROM (
SELECT 
    restaurant_id,
    order_total,
    NTILE(100) OVER (ORDER BY order_total ASC) AS percentile_value
FROM (

SELECT 
    --EXTRACT(MONTH FROM customer_placed_order_datetime) as order_month,
    --EXTRACT(YEAR FROM customer_placed_order_datetime) as order_year,
    restaurant_id, 
    SUM(order_total) AS order_total
FROM doordash_delivery
WHERE EXTRACT(MONTH FROM customer_placed_order_datetime) = 5 and EXTRACT(YEAR FROM customer_placed_order_datetime) = 2020
GROUP BY restaurant_id
) as sub1
) as sub0
WHERE percentile_value < 3
ORDER BY 2 ASC
```

Instead of a subquery we can use a CTE, which is a bit easier to interpret
Alse CTE creates temp tables, so we can re-use the query later

## Leetcode 180. Consecutive Numbers

> https://leetcode.com/problems/consecutive-numbers/

```sql
WITH CTE AS (
SELECT
num,
LAG(num, 1) OVER() AS `prev_1`,
LAG(num, 2) OVER() AS `prev_2`
FROM 
Logs
),
CTE2 AS (
    SELECT
    CASE WHEN num = prev_1 and num = prev_2 THEN num
    ELSE NULL END AS `ConsecutiveNums`
    FROM CTE
)

SELECT DISTINCT ConsecutiveNums FROM CTE2
WHERE ConsecutiveNums IS NOT NULL
```

## Leetcode 262. Trips and Users

> https://leetcode.com/problems/trips-and-users/

```sql

# Write your MySQL query statement below
WITH CTE AS (
SELECT request_at, status, u.banned AS user_banned, u1.banned AS driver_banned
FROM Trips t
INNER JOIN Users u
ON t.client_id = u.users_id
INNER JOIN Users u1 
ON t.driver_id = u1.users_id
    
WHERE u.banned = "No" and u1.banned = "No" and request_at BETWEEN "2013-10-01" and "2013-10-03"
),

CTE2 AS
(
SELECT request_at,
CASE WHEN status LIKE "cancelled%" THEN 1
ELSE 0 END AS new_status
FROM CTE
),
CTE3 AS 
(
SELECT 
    request_at AS Day,
    ROUND(SUM(new_status)/COUNT(new_status), 2) AS `Cancellation Rate`
    FROM CTE2
    GROUP BY request_at
)

SELECT * FROM CTE3

```

## Question: Monthly Percentage Difference

> https://platform.stratascratch.com/coding/10319-monthly-percentage-difference?python=

---

### Soln

```sql
## get SUM(revenue) per year, month
WITH CTE AS (
select YEAR(created_at) AS `year`, MONTH(created_at) AS `month`, SUM(value) AS `monthly_revenue`
from sf_transactions
GROUP BY year, month
ORDER BY year, month
),

### get prev month revenue
CTE2 AS (
SELECT year, month, monthly_revenue,
LAG(monthly_revenue) OVER() AS `prev_revenue`
FROM CTE
),

### get % change in revenue
CTE3 AS (
SELECT year, month, monthly_revenue,prev_revenue,
ROUND((monthly_revenue-prev_revenue)*100/prev_revenue,2) AS `perc_change`
FROM CTE2
),

### Zero pad month
CTE4 AS (
SELECT 
year, month, monthly_revenue,prev_revenue,perc_change,
CASE WHEN month < 10 THEN CONCAT("0", month)
ELSE month 
END AS `zp_month`
FROM CTE3
)

### final result
SELECT
CONCAT(year, "-", zp_month),
perc_change
FROM CTE4
```

## Activity Rank

> https://platform.stratascratch.com/coding/10351-activity-rank?python=
---


```sql
### cte to compute num of emails sent by each user
### and order by reqd specifications
### cannot use rank() as duplicates should have diff ranks
WITH CTE AS 
(
select from_user, COUNT(from_user) AS `total_sent`
FROM google_gmail_emails
GROUP BY from_user
ORDER BY COUNT(from_user) DESC, from_user ASC
)

SELECT from_user, total_sent,
ROW_NUMBER() OVER() AS `custom_rank`
FROM CTE
```

## Popularity Percentage

> https://platform.stratascratch.com/coding/10284-popularity-percentage?python=&utm_source=youtube&utm_medium=click&utm_campaign=YT+description+link

> https://www.youtube.com/watch?v=_gy1o9UH2dQ

---

### Soln

```sql
### get each user1 and count(user2) 
### get each user2 and count(user1)
### UNION these to get each user and total_friends

WITH CTE AS (
select user1, COUNT(user2) AS `total_friends`
FROM facebook_friends
GROUP BY user1

UNION

select user2, COUNT(user1) AS `total_friends`
FROM facebook_friends
GROUP BY user2
),

### get each user and take a sum of total_friends in case of repeated user ids

CTE2 AS (
SELECT user1 AS user, 
SUM(total_friends) AS `total_friends`
FROM CTE
GROUP BY user1
)

### compute % - get total no of users in the table from a subquery

SELECT user,
total_friends*100/(SELECT COUNT(*) FROM CTE2)
FROM CTE2

ORDER BY user

```

## SQL Moving Averages

> https://www.essentialsql.com/sql-puzzle-calculate-moving-averages/

> https://learnsql.com/blog/moving-average-in-sql/
---

The moving average is a time series technique for analyzing and determining trends in data. Sometimes called rolling means, rolling averages, or running averages, they are calculated as the mean of the current and a specified number of immediately preceding values for each point in time. The main idea is to examine how these averages behave over time instead of examining the behavior of the original or raw data points.

![](https://learnsql.com/blog/moving-average-in-sql/Image-2.png)

```sql
select *,
  avg(Price) OVER(ORDER BY Date
     ROWS BETWEEN 2 PRECEDING AND CURRENT ROW )
     as moving_average
from stock_price;
```

- We use a window function, denoted with an OVER clause. As explained earlier, the rows are not collapsed, and each row has its own window over which a calculation is performed.

- The size of the window in our example is 3. For each given row, we take the row itself and the two previous rows, and we calculate the average price from those three rows. This is denoted by the `ROW` keyword in the statement: `ROWS BETWEEN 2 PRECEDING AND CURRENT ROW`. This statement says that, for each row in the table, something is calculated as an aggregation of the current and the previous two rows. This means that the moving average for each row is calculated as the mean price from the given day and the two previous days.

- We have a different window frame for each day. Below, you can see an illustration of the window frame used for the row corresponding to January 9 (in green) and the window frame used for the row corresponding to June 27 (in blue):

![](https://learnsql.com/blog/moving-average-in-sql/Image-5.png)

- It is important that the data __not have any gaps in dates__. For each day, we need to calculate the average of the prices from that day and the two previous days. If there are missing dates in the data, this analysis will not make sense.

- The `ORDER BY` keyword inside the `OVER` clause defines the order of the rows over which the moving average should be calculated. In our example, the rows are first sorted by the date column, then the window frame is defined, and the calculation is performed.

- For this example, we do not use the `PARTITION BY` keyword in the `OVER` clause. `PARTITION BY` groups rows into logical chunks by some category, but we are not grouping rows that way here. In effect, our whole data set is just one large partition. 


```sql

select *,
  avg(Price) OVER(ORDER BY Date
      ROWS BETWEEN 1 PRECEDING AND CURRENT ROW )
     as 2day_moving_average,
  avg(Price) OVER(ORDER BY Date
      ROWS BETWEEN 29 PRECEDING AND CURRENT ROW )
      as 30day_moving_average
from stock_price;

```

![](https://learnsql.com/blog/moving-average-in-sql/3.png)

Now let's practice a little more to recap what we have learned so far. COVID-19 is still very real in our lives, so we will calculate the seven-day moving average for the total number of confirmed cases by country. The number of confirmed cases for each day for each country is stored in a table named confirmed_covid, in the column confirmed_day:

```sql
SELECT *,
      avg(confirmed_day) OVER(
          PARTITION BY country
          ORDER BY date
          ROWS BETWEEN 6 PRECEDING AND CURRENT ROW)
          AS 7day_moving_average
FROM confirmed_covid;
```

You may have noticed this code looks just like the one we wrote for the stock price moving average. The one key difference is that we have partitions here?—?each country is a partition, because we are calculating the seven-day averages separately for each country. Otherwise, only the table and the column names are different. You can easily adapt this code to any other business scenario.

### Meta SQL question 

> https://towardsdatascience.com/the-facebook-data-scientist-interview-38556739e872
---

Given two tables. One an attendance log for every student in a school district and the other a summary table with demographics for each student in the district.

```
attendance_events : date | student_id | attendance

all_students : student_id | school_id | grade_level | date_of_birth | hometown
```

__What percent of students attend school on their birthday?__


```sql
-- step 1: join the 2 tables
WITH cte AS
(
	SELECT date, a.student_id, attendance, date_of_birth 
		FROM attendance a
		INNER JOIN students s
		ON a.student_id = b.student_id
),
-- step2: get num students attending on bday
cte2 AS (
	SELECT COUNT(DISTINCT student_id) AS num_students_bday
  FROM cte 
	WHERE date = date_of_birth
),

--- ratio = num students / students attending on bday
SELECT (SELECT num_students_bday FROM cte2)*100/COUNT(DISTINCT student_id) AS perc_bday
FROM cte
```

__Which grade level had the largest drop in attendance between yesterday and today?__

```sql
-- step 1: join the 2 tables and compute the total attendance for each day and grade
WITH cte AS
(
	SELECT date, grade_level, SUM(attendance) AS attendance 
	FROM attendance a
	INNER JOIN students s
	ON a.student_id = b.student_id
	GROUP BY date, grade_level
),
-- step 2: get prev day attendance by grade level ordered by date
cte2 AS
(
	SELECT date, grade_level, attendance,
	LAG(attendance) OVER (PARTITION BY grade_level ORDER BY date) AS prev_day_attendance
	FROM cte
),
-- step 3: compute attendance drop for current day
cte3 AS
(
	SELECT date, grade_level, attendance, prev_day_attendance,
	prev_day_attendance - attendance AS attendance_drop
	FROM cte2
	WHERE date = (SELECT CURDATE())
),
-- step 4: get grade level with max attendance drop
cte4 AS 
(
	SELECT grade_level
	FROM cte3
	WHERE attendance_drop = (SELECT MAX(attendance_drop) FROM cte3)
)
```

### Goodwater Analytics Question

> https://www.youtube.com/watch?v=FC5X09o85xE

---

![](https://i.imgur.com/oSsFImr.png)


![](https://i.imgur.com/JkjgDUx.png)

```sql
--- get all downloads from ios and android and UNION them

WITH all_product_downloads AS
(
    SELECT product_id, ios_app_id AS app_id, date, downloads
    FROM Products p
    INNER JOIN Downloads d
    ON p.ios_app_id = d.app_id

    UNION

    SELECT product_id, android_app_id AS app_id, date, downloads
    FROM Products p
    INNER JOIN Downloads d
    ON p.android_app_id = d.app_id
),
--- aggregate downloads at a product - date level
product_date_data AS (
    SELECT product_id, date, SUM(downloads) AS total_downloads
    FROM all_product_downloads
    GROUP BY product_id, date

)
```

Now we have product - date level downloads data

Imagine at the next step we calculate 28_day_rolling_downloads like:

`product_id | date | 28_day_rolling_avg`

```sql
28_day_rolling_downloads AS
(
SELECT product_id, date,
AVG(downloads) OVER(PARTITION BY product_id ORDER BY date
ROWS BETWEEN 27 PRECEEDING AND CURRENT ROW
) AS 28_day_rolling_avg
FROM product_date_data

ORDER BY product, date
)
```

```sql

--- get prev year rolling avg data

yoy_data AS (
SELECT product_id, date, 28_day_rolling_avg
LAG(28_day_rolling_avg, 365) OVER(PARTITION BY product_id ORDER BY date) AS prev_year_avg
FROM rolling_cte
)

SELECT product, date,
(28_day_rolling_avg - prev_year_avg)*100/prev_year_avg as YoY_growth
FROM rolling_cte
```

Alternative: Imagine u cant compute rolling avg directly - how will u do it

product_id | date | total_downloads

The way to do this is by using a self join
We can specify AND conditions while joining which tells sql
to keep rows where the datediff is bw 0 and 28

```sql

28_day_rolling_downloads AS(
SELECT
p1.product_id, p1.date, AVG(p2.total_downloads) AS 28_day_rolling_avg
FROM product_date_data p1
INNER JOIN product_date_data p2
ON p1.product_id = p2.product_id
AND DATEDIFF(p1.date, p2.date) <= 28
AND DATEDIFF(p1.date, p2.date) >= 0

GROUP BY p1.product_id, p1.date
)
```


SELECT d1.product_id, d1.date, (d2.28_day_rolling_avg
FROM 28_day_rolling_downloads d1
INNER JOIN 28_day_rolling_downloads d2
ON d1.product_id = d2.product_id
AND DATEDIFF(d1.date, d2.date) = 365

### Advanced Facebook Data Science SQL interview question

> https://www.youtube.com/watch?v=PlpUo6bHsBQ

#### Soln:

```sql
-- join the two tables and filter on dates
WITH cte AS
(
select a.user_id, created_at, country, number_of_comments, MONTH(created_at) AS month
from fb_comments_count a
INNER JOIN fb_active_users b
ON a.user_id = b.user_id
WHERE created_at >= '2019-12-01' AND created_at <= '2020-01-31'
),
-- country - total comments for dec
dec_data AS
(
SELECT 
country, SUM(number_of_comments) AS total_comments
FROM cte
WHERE month = 12
GROUP BY country
),
-- country - total comments for jan
jan_data AS 
(
SELECT 
country, SUM(number_of_comments) AS total_comments
FROM cte
WHERE month = 1
GROUP BY country
),
-- country rank for dec
dec_rank AS
(
SELECT country,total_comments,
DENSE_RANK() OVER(ORDER BY total_comments DESC) AS `rank`
FROM dec_data
),
-- country rank for jan
jan_rank AS
(
SELECT country,total_comments,
DENSE_RANK() OVER(ORDER BY total_comments DESC) AS `rank`
FROM jan_data
)
-- join the two
SELECT a.country, a.rank AS dec_rank, b.rank AS jan_rank
FROM dec_rank a
INNER JOIN jan_rank b
ON a.country = b.country

```

<a style='text-decoration:none;line-height:16px;display:flex;color:#5B5B62;padding:10px;justify-content:end;' href='https://deepnote.com?utm_source=created-in-deepnote-cell&projectId=c9f7b205-46e2-4f7d-8027-1722d788f5d8' target="_blank">
<img alt='Created in deepnote.com' style='display:inline;max-height:16px;margin:0px;margin-right:7.5px;' src='' > </img>
Created in <span style='font-weight:600;margin-left:4px;'>Deepnote</span></a>